Mathonix/AT32F423_LSM6DSV/inc/lsm6dsv_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

/**
  * @brief  Read generic device register
  *
  * @param  ctx   communication interface handler.(ptr)
  * @param  reg   first register address to read.
  * @param  data  buffer for data read.(ptr)
  * @param  len   number of consecutive register to read.
  * @retval       interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_read_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                         uint8_t *data,
                         uint16_t len);

/**
  * @brief  Write generic device register
  *
  * @param  ctx   communication interface handler.(ptr)
  * @param  reg   first register address to write.
  * @param  data  the buffer contains data to be written.(ptr)
  * @param  len   number of consecutive register to write.
  * @retval       interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_write_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                          uint8_t *data,
                          uint16_t len);
/**
  * @}
  *
  */

/**
  * @defgroup  Sensitivity Sensitivity Functions
  * @brief     These functions convert raw-data into engineering units.
  * @{
  *
  */

/**
  * @brief  Convert Accelerometer SFLP lsb into mg (full-scale @2g)
  *
  * @param  lsb   Accelerometer raw data in SFLP mode (full-scale is 2g)
  * @retval       Accelerometer value in mg unit
  *
  */
float_t lsm6dsv_from_sflp_to_mg(int16_t lsb);

/**
  * @brief  Convert Accelerometer lsb into mg (full-scale @2g)
  *
  * @param  lsb   Accelerometer raw data when full-scale is 2g
  * @retval       Accelerometer value in mg unit
  *
  */
float_t lsm6dsv_from_fs2_to_mg(int16_t lsb);

/**
  * @brief  Convert Accelerometer lsb into mg (full-scale @4g)
  *
  * @param  lsb   Accelerometer raw data when full-scale is 4g
  * @retval       Accelerometer value in mg unit
  *
  */
float_t lsm6dsv_from_fs4_to_mg(int16_t lsb);

/**
  * @brief  Convert Accelerometer lsb into mg (full-scale @8g)
  *
  * @param  lsb   Accelerometer raw data when full-scale is 8g
  * @retval       Accelerometer value in mg unit
  *
  */
float_t lsm6dsv_from_fs8_to_mg(int16_t lsb);

/**
  * @brief  Convert Accelerometer lsb into mg (full-scale @16g)
  *
  * @param  lsb   Accelerometer raw data when full-scale is 16g
  * @retval       Accelerometer value in mg unit
  *
  */
float_t lsm6dsv_from_fs16_to_mg(int16_t lsb);

/**
  * @brief  Convert Gyroscope lsb into mdps (full-scale @125dps)
  *
  * @param  lsb   Gyroscope raw data when full-scale is 125dps
  * @retval       Gyroscope value in mdps unit
  *
  */
float_t lsm6dsv_from_fs125_to_mdps(int16_t lsb);

/**
  * @brief  Convert Gyroscope lsb into mdps (full-scale @250dps)
  *
  * @param  lsb   Gyroscope raw data when full-scale is 250dps
  * @retval       Gyroscope value in mdps unit
  *
  */
float_t lsm6dsv_from_fs250_to_mdps(int16_t lsb);

/**
  * @brief  Convert Gyroscope lsb into mdps (full-scale @500dps)
  *
  * @param  lsb   Gyroscope raw data when full-scale is 500dps
  * @retval       Gyroscope value in mdps unit
  *
  */
float_t lsm6dsv_from_fs500_to_mdps(int16_t lsb);

/**
  * @brief  Convert Gyroscope lsb into mdps (full-scale @1000dps)
  *
  * @param  lsb   Gyroscope raw data when full-scale is 1000dps
  * @retval       Gyroscope value in mdps unit
  *
  */
float_t lsm6dsv_from_fs1000_to_mdps(int16_t lsb);

/**
  * @brief  Convert Gyroscope lsb into mdps (full-scale @2000dps)
  *
  * @param  lsb   Gyroscope raw data when full-scale is 2000dps
  * @retval       Gyroscope value in mdps unit
  *
  */
float_t lsm6dsv_from_fs2000_to_mdps(int16_t lsb);

/**
  * @brief  Convert Gyroscope lsb into mdps (full-scale @4000dps)
  *
  * @param  lsb   Gyroscope raw data when full-scale is 4000dps
  * @retval       Gyroscope value in mdps unit
  *
  */
float_t lsm6dsv_from_fs4000_to_mdps(int16_t lsb);

/**
  * @brief  Convert Temperature lsb into Celsius
  *
  * @param  lsb   Temperature raw data
  * @retval       Temperature value in Celsius unit
  *
  */
float_t lsm6dsv_from_lsb_to_celsius(int16_t lsb);

/**
  * @brief  Convert Timestamp lsb into nsec
  *
  * @param  lsb   Timestamp raw data
  * @retval       Timestamp value in nsec unit
  *
  */
float_t lsm6dsv_from_lsb_to_nsec(uint32_t lsb);

/**
  * @brief  Convert from FP16 to FP32 numbers (e.g. quaternions)
  *
  * @param  val      half-precision (16-bit) float number
  * @retval          single-precision (32-bit) float number
  *
  */
uint32_t lsm6dsv_from_f16_to_f32(uint16_t val);

/**
  * @brief  Convert from FP32 to FP16 numbers (e.g. quaternions)
  *
  * @param  val      single-precision (32-bit) float number
  * @retval          half-precision (16-bit) float number
  *
  */
uint16_t lsm6dsv_from_f32_to_f16(float_t val);

/**
  * @}
  *
  */


/**
  * @defgroup  XL_Offset Accelerometer user offset correction
  * @brief      This section groups all the functions concerning the
  *             usage of Accelerometer user offset correction
  * @{
  *
  */

/**
  * @brief  Enables accelerometer user offset correction block; it is valid for the low-pass path.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables accelerometer user offset correction block; it is valid for the low-pass path.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_xl_offset_on_out_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enables accelerometer user offset correction block; it is valid for the low-pass path.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables accelerometer user offset correction block; it is valid for the low-pass path.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_xl_offset_on_out_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  float_t z_mg;
  float_t y_mg;
  float_t x_mg;
} lsm6dsv_xl_offset_mg_t;

/**
  * @brief  Accelerometer user offset correction values in mg.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Accelerometer user offset correction values in mg.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_xl_offset_mg_set(const stmdev_ctx_t *ctx,
                                 lsm6dsv_xl_offset_mg_t val);

/**
  * @brief  Accelerometer user offset correction values in mg.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Accelerometer user offset correction values in mg.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_xl_offset_mg_get(const stmdev_ctx_t *ctx,
                                 lsm6dsv_xl_offset_mg_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  Reset Reset functions
  * @brief      This section groups all the functions concerning the
  *             reset and power on routines.
  * @{
  *
  */

/**
  * @brief Perform reboot of the device.
  *
  * @param  ctx      read / write interface definitions
  * @retval          0: reboot has been performed, -1: error
  *
  */
int32_t lsm6dsv_reboot(const stmdev_ctx_t *ctx);
/**
  * @brief  Perform power-on-reset of the device.
  *
  * @param  ctx      read / write interface definitions
  * @retval          0: power-on-reset has been performed, -1: error
  *
  */
int32_t lsm6dsv_sw_por(const stmdev_ctx_t *ctx);
/**
  * @brief  Perform s/w reset of the device.
  *
  * @param  ctx      read / write interface definitions
  * @retval          0: s/w reset has been performed, -1: error
  *
  */
int32_t lsm6dsv_sw_reset(const stmdev_ctx_t *ctx);

/**
  * @}
  *
  */

