Mathonix/AT32F423_LSM6DSV/inc/lsm6dsv_reg.h
typedef enum
{
  LSM6DSV_DRDY_LATCHED = 0x0,
  LSM6DSV_DRDY_PULSED  = 0x1,
} lsm6dsv_data_ready_mode_t;

/**
  * @brief  Enables pulsed data-ready mode (~75 us).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DRDY_LATCHED, DRDY_PULSED,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_data_ready_mode_set(const stmdev_ctx_t *ctx,
                                    lsm6dsv_data_ready_mode_t val);

/**
  * @brief  Enables pulsed data-ready mode (~75 us).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DRDY_LATCHED, DRDY_PULSED,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_data_ready_mode_get(const stmdev_ctx_t *ctx,
                                    lsm6dsv_data_ready_mode_t *val);

typedef struct
{
  uint8_t enable               : 1; /* interrupt enable */
  uint8_t lir                  : 1; /* interrupt pulsed or latched */
} lsm6dsv_interrupt_mode_t;

/**
  * @brief  Enables interrupt.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      enable/disable, latched/pulsed
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_interrupt_enable_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv_interrupt_mode_t val);

/**
  * @brief  Enables latched interrupt mode.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      enable/disable, latched/pulsed
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_interrupt_enable_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv_interrupt_mode_t *val);

typedef enum
{
  LSM6DSV_125dps  = 0x0,
  LSM6DSV_250dps  = 0x1,
  LSM6DSV_500dps  = 0x2,
  LSM6DSV_1000dps = 0x3,
  LSM6DSV_2000dps = 0x4,
  LSM6DSV_4000dps = 0xc,
} lsm6dsv_gy_full_scale_t;

/**
  * @brief  Gyroscope full-scale selection[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      125dps, 250dps, 500dps, 1000dps, 2000dps, 4000dps,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_gy_full_scale_set(const stmdev_ctx_t *ctx,
                                  lsm6dsv_gy_full_scale_t val);
/**
  * @brief  Gyroscope full-scale selection[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      125dps, 250dps, 500dps, 1000dps, 2000dps, 4000dps,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_gy_full_scale_get(const stmdev_ctx_t *ctx,
                                  lsm6dsv_gy_full_scale_t *val);

typedef enum
{
  LSM6DSV_2g  = 0x0,
  LSM6DSV_4g  = 0x1,
  LSM6DSV_8g  = 0x2,
  LSM6DSV_16g = 0x3,
} lsm6dsv_xl_full_scale_t;

/**
  * @brief  Accelerometer full-scale selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv_xl_full_scale_t
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                  lsm6dsv_xl_full_scale_t val);

/**
  * @brief  Accelerometer full-scale selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv_xl_full_scale_t
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                  lsm6dsv_xl_full_scale_t *val);

/**
  * @brief  It enables the accelerometer Dual channel mode: data with selected full scale and data with maximum full scale are sent simultaneously to two different set of output registers.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      It enables the accelerometer Dual channel mode: data with selected full scale and data with maximum full scale are sent simultaneously to two different set of output registers.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_xl_dual_channel_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  It enables the accelerometer Dual channel mode: data with selected full scale and data with maximum full scale are sent simultaneously to two different set of output registers.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      It enables the accelerometer Dual channel mode: data with selected full scale and data with maximum full scale are sent simultaneously to two different set of output registers.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_xl_dual_channel_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV_XL_ST_DISABLE  = 0x0,
  LSM6DSV_XL_ST_POSITIVE = 0x1,
  LSM6DSV_XL_ST_NEGATIVE = 0x2,
} lsm6dsv_xl_self_test_t;

/**
  * @brief  Accelerometer self-test selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      XL_ST_DISABLE, XL_ST_POSITIVE, XL_ST_NEGATIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_xl_self_test_set(const stmdev_ctx_t *ctx,
                                 lsm6dsv_xl_self_test_t val);

/**
  * @brief  Accelerometer self-test selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      XL_ST_DISABLE, XL_ST_POSITIVE, XL_ST_NEGATIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_xl_self_test_get(const stmdev_ctx_t *ctx,
                                 lsm6dsv_xl_self_test_t *val);

typedef enum
{
  LSM6DSV_OIS_XL_ST_DISABLE  = 0x0,
  LSM6DSV_OIS_XL_ST_POSITIVE = 0x1,
  LSM6DSV_OIS_XL_ST_NEGATIVE = 0x2,
} lsm6dsv_ois_xl_self_test_t;

/**
  * @brief  SPI2 Accelerometer self-test selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      XL_ST_DISABLE, XL_ST_POSITIVE, XL_ST_NEGATIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_ois_xl_self_test_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv_ois_xl_self_test_t val);

/**
  * @brief  SPI2 Accelerometer self-test selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      XL_ST_DISABLE, XL_ST_POSITIVE, XL_ST_NEGATIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_ois_xl_self_test_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv_ois_xl_self_test_t *val);

