Mathonix/AT32F423_LSM6DSV/inc/lsm6dsv_reg.h
/* Temperature data format in FIFO */
typedef struct
{
  uint16_t temperature;
} lsm6dsv_fifo_temperature;

/* Timestamp  format in FIFO */
typedef struct
{
  uint32_t timestamp;
} lsm6dsv_fifo_timestamp;

/* Step counter data format in FIFO */
typedef struct
{
  uint16_t steps;
  uint32_t timestamp;
} lsm6dsv_fifo_step_counter;

typedef enum
{
  LSM6DSV_FIFO_EMPTY                    = 0x0,
  LSM6DSV_GY_NC_TAG                     = 0x1,
  LSM6DSV_XL_NC_TAG                     = 0x2,
  LSM6DSV_TEMPERATURE_TAG               = 0x3,
  LSM6DSV_TIMESTAMP_TAG                 = 0x4,
  LSM6DSV_CFG_CHANGE_TAG                = 0x5,
  LSM6DSV_XL_NC_T_2_TAG                 = 0x6,
  LSM6DSV_XL_NC_T_1_TAG                 = 0x7,
  LSM6DSV_XL_2XC_TAG                    = 0x8,
  LSM6DSV_XL_3XC_TAG                    = 0x9,
  LSM6DSV_GY_NC_T_2_TAG                 = 0xA,
  LSM6DSV_GY_NC_T_1_TAG                 = 0xB,
  LSM6DSV_GY_2XC_TAG                    = 0xC,
  LSM6DSV_GY_3XC_TAG                    = 0xD,
  LSM6DSV_SENSORHUB_SLAVE0_TAG          = 0xE,
  LSM6DSV_SENSORHUB_SLAVE1_TAG          = 0xF,
  LSM6DSV_SENSORHUB_SLAVE2_TAG          = 0x10,
  LSM6DSV_SENSORHUB_SLAVE3_TAG          = 0x11,
  LSM6DSV_STEP_COUNTER_TAG              = 0x12,
  LSM6DSV_SFLP_GAME_ROTATION_VECTOR_TAG = 0x13,
  LSM6DSV_SFLP_GYROSCOPE_BIAS_TAG       = 0x16,
  LSM6DSV_SFLP_GRAVITY_VECTOR_TAG       = 0x17,
  LSM6DSV_SENSORHUB_NACK_TAG            = 0x19,
  LSM6DSV_XL_DUAL_CORE                  = 0x1D,
  LSM6DSV_GY_ENHANCED_EIS               = 0x1E,
} lsm6dsv_fifo_tag;

typedef struct
{
  uint8_t tag  : 5;
  uint8_t cnt  : 2;
  uint8_t rsvd : 1;
  uint8_t data[6];
} lsm6dsv_fifo_out_raw_t;

/**
  * @brief  FIFO data output[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv_fifo_out_raw_t
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_fifo_out_raw_get(const stmdev_ctx_t *ctx,
                                 lsm6dsv_fifo_out_raw_t *val);

/**
  * @brief  Batching in FIFO buffer of step counter value.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of step counter value.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_fifo_stpcnt_batch_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Batching in FIFO buffer of step counter value.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of step counter value.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_fifo_stpcnt_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Enable FIFO data batching of slave idx.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enable FIFO data batching of slave idx.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_fifo_sh_batch_slave_set(const stmdev_ctx_t *ctx, uint8_t idx, uint8_t val);

/**
  * @brief  Enable FIFO data batching of slave idx.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enable FIFO data batching of slave idx.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_fifo_sh_batch_slave_get(const stmdev_ctx_t *ctx, uint8_t idx, uint8_t *val);

typedef struct
{
  uint8_t game_rotation        : 1;
  uint8_t gravity              : 1;
  uint8_t gbias                : 1;
} lsm6dsv_fifo_sflp_raw_t;

/**
  * @brief  Batching in FIFO buffer of SFLP.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of SFLP values.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_fifo_sflp_batch_set(const stmdev_ctx_t *ctx,
                                    lsm6dsv_fifo_sflp_raw_t val);

/**
  * @brief  Batching in FIFO buffer of SFLP.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of SFLP values.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_fifo_sflp_batch_get(const stmdev_ctx_t *ctx,
                                    lsm6dsv_fifo_sflp_raw_t *val);


/**
  * @}
  *
  */

/**
  * @defgroup  Filters Filter Configuration
  * @brief     This section group all the functions concerning the
  *            filters configuration
  * @{
  *
  */

typedef enum
{
  LSM6DSV_AUTO          = 0x0,
  LSM6DSV_ALWAYS_ACTIVE = 0x1,
} lsm6dsv_filt_anti_spike_t;

/**
  * @brief  Protocol anti-spike filters.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      AUTO, ALWAYS_ACTIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_filt_anti_spike_set(const stmdev_ctx_t *ctx,
                                    lsm6dsv_filt_anti_spike_t val);

/**
  * @brief  Protocol anti-spike filters.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      AUTO, ALWAYS_ACTIVE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_filt_anti_spike_get(const stmdev_ctx_t *ctx,
                                    lsm6dsv_filt_anti_spike_t *val);

typedef struct
{
  uint8_t drdy                 : 1;
  uint8_t ois_drdy             : 1;
  uint8_t irq_xl               : 1;
  uint8_t irq_g                : 1;
} lsm6dsv_filt_settling_mask_t;

/**
  * @brief  It masks DRDY and Interrupts RQ until filter settling ends.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      It masks DRDY and Interrupts RQ until filter settling ends.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_filt_settling_mask_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv_filt_settling_mask_t val);

/**
  * @brief  It masks DRDY and Interrupts RQ until filter settling ends.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      It masks DRDY and Interrupts RQ until filter settling ends.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_filt_settling_mask_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv_filt_settling_mask_t *val);

typedef struct
{
  uint8_t ois_drdy             : 1;
} lsm6dsv_filt_ois_settling_mask_t;

/**
  * @brief  It masks DRDY and Interrupts RQ until filter settling ends.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      It masks DRDY and Interrupts RQ until filter settling ends from OIS interface.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_filt_ois_settling_mask_set(const stmdev_ctx_t *ctx,
                                           lsm6dsv_filt_ois_settling_mask_t val);

/**
  * @brief  It masks DRDY and Interrupts RQ until filter settling ends.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      It masks DRDY and Interrupts RQ until filter settling ends.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_filt_ois_settling_mask_get(const stmdev_ctx_t *ctx,
                                           lsm6dsv_filt_ois_settling_mask_t *val);

