Mathonix/AT32F423_LSM6DSV/inc/lsm6dsv_reg.h
typedef enum
{
  LSM6DSV_OIS_125dps  = 0x0,
  LSM6DSV_OIS_250dps  = 0x1,
  LSM6DSV_OIS_500dps  = 0x2,
  LSM6DSV_OIS_1000dps = 0x3,
  LSM6DSV_OIS_2000dps = 0x4,
} lsm6dsv_ois_gy_full_scale_t;
/**
  * @brief  Gyroscope OIS full-scale selection[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      OIS_125dps, OIS_250dps, OIS_500dps, OIS_1000dps, OIS_2000dps,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_ois_gy_full_scale_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv_ois_gy_full_scale_t val);
/**
  * @brief  Gyroscope OIS full-scale selection[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      OIS_125dps, OIS_250dps, OIS_500dps, OIS_1000dps, OIS_2000dps,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_ois_gy_full_scale_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv_ois_gy_full_scale_t *val);

typedef enum
{
  LSM6DSV_OIS_2g  = 0x0,
  LSM6DSV_OIS_4g  = 0x1,
  LSM6DSV_OIS_8g  = 0x2,
  LSM6DSV_OIS_16g = 0x3,
} lsm6dsv_ois_xl_full_scale_t;
/**
  * @brief  Selects accelerometer OIS channel full-scale.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv_ois_xl_full_scale_t
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_ois_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                      lsm6dsv_ois_xl_full_scale_t val);
/**
  * @brief  Selects accelerometer OIS channel full-scale.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv_ois_xl_full_scale_t
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_ois_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                      lsm6dsv_ois_xl_full_scale_t *val);


/**
  * @}
  *
  */

/**
  * @defgroup  6D_4D 6D (and 4D) Orientation Configuration
  * @brief     This section groups all the functions concerning six position
  *            detection (6D).
  * @{
  *
  */
typedef enum
{
  LSM6DSV_DEG_80 = 0x0,
  LSM6DSV_DEG_70 = 0x1,
  LSM6DSV_DEG_60 = 0x2,
  LSM6DSV_DEG_50 = 0x3,
} lsm6dsv_6d_threshold_t;
/**
  * @brief  Threshold for 4D/6D function.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DEG_80, DEG_70, DEG_60, DEG_50,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_6d_threshold_set(const stmdev_ctx_t *ctx,
                                 lsm6dsv_6d_threshold_t val);
/**
  * @brief  Threshold for 4D/6D function.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DEG_80, DEG_70, DEG_60, DEG_50,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_6d_threshold_get(const stmdev_ctx_t *ctx,
                                 lsm6dsv_6d_threshold_t *val);

/**
  * @brief  4D orientation detection enable. Z-axis position detection is disabled.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      4D orientation detection enable. Z-axis position detection is disabled.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_4d_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
/**
  * @brief  4D orientation detection enable. Z-axis position detection is disabled.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      4D orientation detection enable. Z-axis position detection is disabled.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_4d_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  I3C SenseWire (I3C) Configuration
  * @brief     This section group all the functions concerning the
  *            usage of SenseWire (I3C)
  * @{
  *
  */

typedef enum
{
  LSM6DSV_SW_RST_DYN_ADDRESS_RST = 0x0,
  LSM6DSV_I3C_GLOBAL_RST         = 0x1,
} lsm6dsv_i3c_reset_mode_t;
/**
  * @brief  Selects the action the device will perform after "Reset whole chip" I3C pattern.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SW_RST_DYN_ADDRESS_RST, GLOBAL_RST,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_i3c_reset_mode_set(const stmdev_ctx_t *ctx,
                                   lsm6dsv_i3c_reset_mode_t val);
/**
  * @brief  Selects the action the device will perform after "Reset whole chip" I3C pattern.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      SW_RST_DYN_ADDRESS_RST, I3C_GLOBAL_RST,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_i3c_reset_mode_get(const stmdev_ctx_t *ctx,
                                   lsm6dsv_i3c_reset_mode_t *val);

/**
  * @brief  Enable/Disable INT pin when I3C is used.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0: disabled, 1: enabled
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_i3c_int_en_set(const stmdev_ctx_t *ctx, uint8_t val);
/**
  * @brief  Enable/Disable INT pin when I3C is used.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      0: disabled, 1: enabled
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_i3c_int_en_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV_IBI_2us  = 0x0,
  LSM6DSV_IBI_50us = 0x1,
  LSM6DSV_IBI_1ms  = 0x2,
  LSM6DSV_IBI_25ms = 0x3,
} lsm6dsv_i3c_ibi_time_t;
/**
  * @brief  Select the us activity time for IBI (In-Band Interrupt) with I3C[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      IBI_2us, IBI_50us, IBI_1ms, IBI_25ms,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_i3c_ibi_time_set(const stmdev_ctx_t *ctx,
                                 lsm6dsv_i3c_ibi_time_t val);
/**
  * @brief  Select the us activity time for IBI (In-Band Interrupt) with I3C[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      IBI_2us, IBI_50us, IBI_1ms, IBI_25ms,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_i3c_ibi_time_get(const stmdev_ctx_t *ctx,
                                 lsm6dsv_i3c_ibi_time_t *val);


/**
  * @}
  *
  */

/**
  * @defgroup  SH Sensor hub Configuration
  * @brief     This section groups all the functions that manage the
  *            sensor hub.
  * @{
  *
  */

/**
  * @brief  Sensor Hub master I2C pull-up enable.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensor Hub master I2C pull-up enable.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_sh_master_interface_pull_up_set(const stmdev_ctx_t *ctx,
                                                uint8_t val);
/**
  * @brief  Sensor Hub master I2C pull-up enable.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensor Hub master I2C pull-up enable.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_sh_master_interface_pull_up_get(const stmdev_ctx_t *ctx,
                                                uint8_t *val);

/**
  * @brief  Sensor hub output registers.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Sensor hub output registers.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv_sh_read_data_raw_get(const stmdev_ctx_t *ctx, uint8_t *val,
                                     uint8_t len);

